<a href="https://colab.research.google.com/github/Pimmiiiu/DW/blob/master/Pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

#PANDAS

In [0]:
import pandas as pd

In [2]:
df = pd.read_csv("https://raw.githubusercontent.com/Pimmiiiu/DW/master/titanicc.csv")
df

          First;Allen  Miss. Elisabeth Walton;Female;29.0;0;0;24160;211.3375;B5;Southampton;2;Yes
0       First;Allison   Master. Hudson Trevor;Male;0.9167;1;2;113781;...
1       First;Allison   Miss. Helen Loraine;Female;2.0;1;2;113781;151...
2       First;Allison   Mr. Hudson Joshua Creighton;Male;30.0;1;2;113...
3       First;Allison   Mrs. Hudson J C (Bessie Waldo Daniels);Female...
4      First;Anderson   Mr. Harry;Male;48.0;0;0;19952;26.55;E12;South...
...               ...                                                ...
1303     Third;Zabour   Miss. Hileni;Female;14.5;1;0;2665;14.4542;;Ch...
1304     Third;Zabour   Miss. Thamine;Female;;1;0;2665;14.4542;;Cherb...
1305   Third;Zakarian   Mr. Mapriededer;Male;26.5;0;0;2656;7.225;;Che...
1306   Third;Zakarian   Mr. Ortin;Male;27.0;0;0;2670;7.225;;Cherbourg...
1307  Third;Zimmerman   Mr. Leo;Male;29.0;0;0;315082;7.875;;Southampt...

[1308 rows x 2 columns]